[
    
    {
        "name": "TEDx Club",
        "description": "TEDx Club is a community of enthusiastic TEDx speakers and students at MMHS.",
        "emoji_id": 15
    },
    {
        "name": "Student Leaders at Milliken (SLAM)",
        "url": "https://www.instagram.com/mmhs_slam/",
        "description": "Are you a reliable, enthusiastic, and hard-working student who is interested in acting as a leader, role model, mentor, and representative of Milliken next year? If so, SLAM wants you! SLAM stands for Student Leaders at Milliken, and as either a general or executive member, you will be responsible for running a variety of school activities, including our very important Welcome Orientation and Camp Day for new Grade 9 students. General member positions are open to ALL students at Milliken. Executive positions are only open to those students with previous SLAM experience. ",
        "emoji_id": 1,

        "how_to": "General Member Application: *https://forms.gle/oniaHRMr4RD5dBgCA*\nExecutive Member Application: *https://forms.gle/q7bup3aybB57rdea9*"
    },
    {
        "name": "Student Activity Council (SAC)",
        "url": "https://www.instagram.com/milliken_sac/?hl=en",
        "description": "Student Activity Council of Milliken Mills HS! 😊📚❤️",
        "emoji_id": 1,

        "how_to": "SAC ressources can be found at: *https://linktr.ee/millikensac*"
    },
    {
        "name": "Milliken Athletic Council (MAC)",
        "url": "https://www.instagram.com/mmhsmac/",
        "description": "Sports club at MMHS",
        "emoji_id": 4,

        "how_to": "Application forms and position descriptions can be found at: *https://linktr.ee/millikenmac*"
    },
    {
        "name": "Knight Writer",
        "description": "Welcome to Milliken Mills High School's one and only school newspaper Twitter page! Check out http://knightwriter.tk for more information! #TeamFollowBack.",
        "url": "https://mobile.twitter.com/_knightwriter",
        "emoji_id": 26
    },
    {
        "name": "Knightrogen Science Club",
        "description": "A science club at MMHS",
        "emoji_id": 3
    },
    {
        "name": "MMHS healthy schools",
        "url": "https://www.instagram.com/mmhshealthyschools/?hl=en",
        "description": "MMHS healthy schools",
        "emoji_id": 10
    },
    {
        "name": "Green Inc",
        "description": "An environmental club at MMHS",
        "url": "https://www.instagram.com/mmhs_green_inc/",
        "emoji_id": 0,

        "how_to": "Google Classroom Link: *https://classroom.google.com/u/0/c/MzQ0OTI4OTQ5NTA2?cjc=ai2zgce*"
    },
    {
        "name": "Gay-Straight Alliance (GSA)",
        "description": "GSA at MMHS",
        "emoji_id": 21
    },
    {
        "name": "French Club (Club de français)",
        "description": "French club at MMHS",
        "emoji_id": 9
    },
    {
        "name": "MMHS Math Society",
        "url" :"https://www.linkedin.com/company/mmhs-math-society/about/",
        "description": "Mathematics Club for all students at Milliken Mills High School. Currently has 76 members and lead by an executive team of 8 individuals. Focuses on UWaterloo math contest preparation and academic enrichment. Weekly meetings cover math contest content (advanced number theory, math proofs, combinatorics, etc.) through synchronous lessons, problem sets, mock competitions, and more!",
        "emoji_id": 12
    },
    {
        "name": "Free the Children",
        "url": "https://m.facebook.com/groups/160173010740274/",
        "description": "Free the children at MMHS",
        "emoji_id": 9
    },
    {
        "name": "Fencing Club",
        "description": "Fencing at mmhs",
        "emoji_id": 25
    },
    {
        "name": "Feed the Mind",
        "description": "Feed the Mind Club at mmhs",
        "emoji_id": 7
    },
    {
        "name": "Milliken Mills Equity Club",
        "url": "https://www.instagram.com/milliken_equity/?hl=en",
        "description": "Inspire Changes, Together As One. We Can Make a Difference! Safe Space #hereforyou",
        "emoji_id": 21,

        "how_to": "Google Classroom Code: *imuvpn6*\nGoogle Form Sign-up: *https://forms.gle/KUdJgZ1YmoP6jnys9*"
    },
    {
        "name": "Dungeons & Dragons (DnD)",
        "description": "Dungeons and Dragobs at MMHS",
        "emoji_id": 24
    },
    {
        "name": "Duke of Edinburgh Club",
        "description": "The Duke of Edinburgh’s International Award is a global program that challenges, empowers, and recognizes young people between the ages of 14 and 24. By recognizing the amazing things young people can do and learn outside the boundaries of formal education, the Award empowers them to discover hidden talents, develop untapped leadership potential and make a difference in their community. ",
        "emoji_id": 23
    },
    {
        "name": "MMHS Drama Club",
        "url": "https://www.instagram.com/mmhsproductions/?hl=en",
        "description": "A Drama Club at MMHS!",
        "emoji_id": 22
    },
    {
        "name": "Milliken Music",
        "url": "https://www.instagram.com/millikenmusic/?hl=en",
        "description": "The Milliken Mills Music Department offers courses in both Performance and Non-Performance Music. The emphasis in all areas is contemporary music including Jazz, Popular and Modern music, however classical style, theory and technique will be taught in context with contemporary repertoire.",
        "emoji_id": 5
    },
    {
        "name": "Behind the Scenes (BTS) - Film and Photography Club",
        "url": "https://www.facebook.com/groups/251642038212498/",
        "description": "Welcome to Milliken's Film and Photography Club! ...is what I'd like to say. We're actually a secretive club working behind the scenes. Our true objective is world domination",
        "emoji_id": 20
    },
    {
        "name": "Best Buddies Club",
        "url": "https://twitter.com/bestbuddiesmmhs",
        "description": "Best Buddies Canada is a national registered charity that promotes inclusion by creating lasting one-to-one friendships between individuals living with and without intellectual and developmental disabilities (IDD and Autism Spectrum Disorder).",
        "emoji_id": 21
    },
    {
        "name": "Book Cafe",
        "description": "Book Cafe",
        "emoji_id": 7
    },
    {
        "name": "CDN Computing Competition (CCC)",
        "description": "The Canadian Computing Competition (CCC) is a fun challenge for students with an interest in programming. Designed to be both accessible to students with some programming experience and to challenge the keenest programmers at the secondary-school level, the CCC helps students build confidence and grow their ability to design, understand and implement algorithms.",
        "emoji_id": 6
    },
    {
        "name": "Chinese Student Association (CSA)",
        "description": "The Chinese Student Association (CSA) is a student-run organization that aims to provide a safe and supportive environment for Chinese students. The CSA is a student-run organization that aims to provide a safe and supportive environment for Chinese students. The CSA is a student-run organization that aims to provide a safe and supportive environment for Chinese students.",
        "emoji_id": 9
    },
    {
        "name": "Computer Lab Assistants",
        "description": "Computer Lab Assistants",
        "emoji_id": 6
    },
    {
        "name": "Concert Choir",
        "description": "Concert Choir",
        "emoji_id": 5
    },
    {
        "name": "DECA",
        "description": "With a 75-year history, DECA has impacted the lives of more than ten million students, educators, school administrators and business professionals since it was founded in 1946. Their strong connection with our organization has resonated into a brand that people identify as a remarkable experience in the preparation of emerging leaders and entrepreneurs. DECA’s programs and activities have constantly evolved as we use the latest technology and apply cutting edge educational research.",
        "emoji_id": 2
    }
    
]